podonoghue/SolderingStation/Software/KinetisBootloader/Project_Headers/pin_mapping.h
   }; 

};

#define USBDM_ADC1_IS_DEFINED
/**
 * Peripheral information for ADC, Analogue Input.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
#ifndef USBDM_ADC_CLOCK_SOURCES_DEFINED
#define USBDM_ADC_CLOCK_SOURCES_DEFINED
   /**
    * ADC input clock source.
    */
   enum AdcClockSource {
      AdcClockSource_Bus      = ADC_CFG1_ADICLK(0), //!< Bus Clock
   #if defined(USB_CLK_RECOVER_IRC_EN_REG_EN_MASK)
      AdcClockSource_Irc48m   = ADC_CFG1_ADICLK(1), //!< IRC 48MHz clock
   #else
      AdcClockSource_Busdiv2  = ADC_CFG1_ADICLK(1), //!< Bus Clock / 2
   #endif
      AdcClockSource_Alt      = ADC_CFG1_ADICLK(2), //!< Alternate clock (ALTCLK)
      AdcClockSource_Asynch   = ADC_CFG1_ADICLK(3), //!< Asynchronous clock (ADACK Internal ADC clock source)
      AdcClockSource_Default  = AdcClockSource_Asynch
   };
#endif

class Adc1Info {
public:
   // Template:adc0_diff_pga_a

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = ADC1_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<ADC_Type> adc = baseAddress;

   //! Map all allocated pins on a peripheral when enabled
   static constexpr bool mapPinsOnEnable = false;

   /* Template_irqOption.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = ADC1_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   /**
    *  Get input clock frequency for ADC
    *  
    *  @param adcClockSource Clock source chosen for ADC
    *
    *  @return Frequency in Hz
    */
   static unsigned getInputClockFrequency(AdcClockSource adcClockSource) {
      switch (adcClockSource) {
         case AdcClockSource_Bus:
            return SystemBusClock;
   #if defined(USB_CLK_RECOVER_IRC_EN_REG_EN_MASK)
         case AdcClockSource_Irc48m:
            return McgInfo::irc48m_clock;
   #else
         case AdcClockSource_Busdiv2:
            return SystemBusClock/2;
   #endif
         case AdcClockSource_Alt:
            return  Osc0Info::getOscerClock();;
         case AdcClockSource_Asynch:
            return 2000000; // Actually varies with ADLPC/ADHSC
         default:
            return 0;
      }
   }

   /**
    *  Get input clock frequency for ADC
    *
    *  @return Frequency in Hz
    */
   static unsigned getInputClockFrequency() {
      return getInputClockFrequency(static_cast<AdcClockSource>(adc->CFG1 & ADC_CFG1_ADICLK_MASK));
   }

   //! Default resolution
   static constexpr uint32_t defaultAdcResolution = ADC_CFG1_MODE(2);

   //! Default value for ADCx_CFG1 register
   static constexpr uint32_t cfg1  = 
       ADC_CFG1_ADICLK(3)|
       ADC_CFG1_MODE(2)|
       ADC_CFG1_ADLSMP(0)|
       ADC_CFG1_ADIV(0)|
       ADC_CFG1_ADLPC(0);

   //! Default value for ADCx_CFG2 register
    static constexpr uint32_t cfg2  = 
       ADC_CFG2_MUXSEL_MASK | // Choose 'b' channels
       ADC_CFG2_ADLSTS(0)|
       ADC_CFG2_ADHSC(0)|
       ADC_CFG2_ADACKEN(0);

   //! Default value for ADCx_SC2 register
   static constexpr uint32_t sc2  =
       ADC_SC2_ACFE(0)|
       ADC_SC2_ACFGT(0)|
       ADC_SC2_ACREN(0)|
       ADC_SC2_REFSEL(0)|
       ADC_SC2_DMAEN(0)|
       ADC_SC2_ADTRG(0);

   //! Default value for ADCx_CV1 register
   static constexpr uint32_t cv1  = 0;

   //! Default value for ADCx_CV2 register
   static constexpr uint32_t cv2  = 0;

   /** 
    *  Enable clock to Adc1
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableAdc1Clock();
#else
      SIM->SCGC3 = SIM->SCGC3 | SIM_SCGC3_ADC1_MASK;
#endif
   }

   /** 
    *  Disable clock to Adc1
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableAdc1Clock();
#else
      SIM->SCGC3 = SIM->SCGC3 & ~SIM_SCGC3_ADC1_MASK;
#endif
   }

   //! Number of signals available in info table
   static constexpr int numSignals  = 38;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: ADC1_SE0             = PGA1_DP(p11)                   */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*   1: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*   2: PGA1                 = PGA1_DP(p11)                   */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*   3: ADC1_SE3             = PGA0_DP(p9)                    */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*   4: ADC1_SE4b            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   5: ADC1_SE5b            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   6: ADC1_SE6b            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   7: ADC1_SE7b            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   8: ADC1_SE8             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   9: ADC1_SE9             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  10: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  11: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  12: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  13: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  14: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  15: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  16: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  17: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  18: ADC1_SE18            = VREF_OUT(p17)                  */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*  19: ADC1_SE19            = PGA1_DM(p12)                   */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*  20: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  21: ADC1_SE21            = PGA0_DM(p10)                   */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*  22: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  23: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  24: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  25: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  26: ADC1_SE26            = TEMP_SENSOR(Internal)          */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*  27: ADC1_SE27            = BANDGAP(Internal)              */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*  28: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  29: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  30: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  31: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  32: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  33: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  34: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  35: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  36: ADC1_SE4a            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  37: ADC1_SE5a            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {
   }

#define USBDM_ADC1_INFODP_IS_DEFINED
   class InfoDP {
   public:
      //! Number of signals available in info table
      static constexpr int numSignals  = 4;

      //! Information for each signal of peripheral
      static constexpr PinInfo  info[] = {
   
