podonoghue/SolderingStation/Software/KinetisBootloader/Project_Headers/pin_mapping.h
            //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
            /*   0: ADC1_DP0             = PGA1_DP(p11)                   */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
            /*   1: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
            /*   2: PGA1_DP              = PGA1_DP(p11)                   */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
            /*   3: ADC1_DP3             = PGA0_DP(p9)                    */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
      };

      /**
       * Initialise pins used by peripheral

       * @note Only the lower 16-bits of the PCR registers are affected
       */
      static void initPCRs() {
      }

      /**
       * Resets pins used by peripheral

       * @note Only the lower 16-bits of the PCR registers are affected
       */
      static void clearPCRs() {
      }

   }; 

#define USBDM_ADC1_INFODM_IS_DEFINED
   class InfoDM {
   public:
      //! Number of signals available in info table
      static constexpr int numSignals  = 4;

      //! Information for each signal of peripheral
      static constexpr PinInfo  info[] = {
   
            //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
            /*   0: ADC1_DM0             = PGA1_DM(p12)                   */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
            /*   1: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
            /*   2: PGA1_DM              = PGA1_DM(p12)                   */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
            /*   3: ADC1_DM3             = PGA0_DM(p10)                   */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
      };

      /**
       * Initialise pins used by peripheral

       * @note Only the lower 16-bits of the PCR registers are affected
       */
      static void initPCRs() {
      }

      /**
       * Resets pins used by peripheral

       * @note Only the lower 16-bits of the PCR registers are affected
       */
      static void clearPCRs() {
      }

   }; 

};

/** 
 * End group ADC_Group
 * @}
 */
/**
 * @addtogroup CAN_Group CAN, Controller Area Network
 * @brief Abstraction for Controller Area Network
 * @{
 */
#define USBDM_CAN0_IS_DEFINED
/**
 * Peripheral information for CAN, Controller Area Network.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
#ifndef USBDM_CAN1_IS_DEFINED
   /**
    * FlexCAN Clock sources
    */
   enum CanClockSource {
      CanClockSource_0 = false,
      CanClockSource_1 = true,
      CanClockSource_Oserclk   = CanClockSource_0,
      CanClockSource_Busclk    = CanClockSource_1,
      CanClockSource_Default   = CanClockSource_0,
   };
#endif

class Can0Info {
public:
   // Template:can0_flex_mk

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = CAN0_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<CAN_Type> can = baseAddress;

   //! Map all allocated pins on a peripheral when enabled
   static constexpr bool mapPinsOnEnable = false;

   //! Whether FIFO is enable
   static constexpr bool EnableFifo     =  1;

   //! Maximum number of Message Buffers
   static constexpr unsigned MaxNumberOfMessageBuffers     =  16;

   //! Maximum number of Message Filters
   static constexpr unsigned MaxNumberOfFifoMessageFilters =  1?40:0;

   //! Number of Mailbox Buffers
   static constexpr unsigned NumberOfIndividualMailboxes   =  8;

   //! Number of FIFO Message Filters
   static constexpr unsigned NumberOfFifoMessageFilters    =  1?16:0;

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = CAN0_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   static constexpr int MessageBuffer_IrqNumIndex       = 0;
   static constexpr int BusOff_IrqNumIndex              = 1;
   static constexpr int Error_IrqNumIndex               = 2;
   static constexpr int TransmitWarning_IrqNumIndex     = 3;
   static constexpr int ReceiveWarning_IrqNumIndex      = 4;
   static constexpr int Wakeup_IrqNumIndex              = 5;

   /**
    * Get Controller Host Interface input clock frequency
    *
    * @return Input clock frequency as a uint32_t in Hz
    */
   static uint32_t getChiClockFrequency() {
      return SystemCoreClock;
   }

   /**
    * Get Protocol Engine input clock frequency
    *
    * @param clksrc value for CAN_CTRL1_CLKSRC
    *
    * @return CAN input clock frequency as a uint32_t in Hz
    */
   static uint32_t getPeClockFrequency(CanClockSource clksrc) {
      if (clksrc) {
         return SystemBusClock;
      }
      else {
         return Osc0Info::getOscerClock();
      }
   }

   /**
    * Get Protocol Engine input clock frequency
    *
    * @return CAN input clock frequency as a uint32_t in Hz
    */
   static uint32_t getPeClockFrequency() {
       return getPeClockFrequency((CanClockSource)(can->CTRL1 & CAN_CTRL1_CLKSRC_MASK));
   }

   //! Default IRQ level
   static constexpr uint32_t irqLevel =  8;

   /** 
    *  Enable clock to Can0
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableCan0Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 | SIM_SCGC6_CAN0_MASK;
#endif
   }

   /** 
    *  Disable clock to Can0
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableCan0Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 & ~SIM_SCGC6_CAN0_MASK;
#endif
   }

   //! Number of signals available in info table
   static constexpr int numSignals  = 2;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

