podonoghue/SolderingStation/Software/KinetisBootloader/Project_Headers/pin_mapping.h
};

/** 
 * End group CMP_Group
 * @}
 */
/**
 * @addtogroup CMT_Group CMT, Carrier Modulator Transmitter
 * @brief Abstraction for Carrier Modulator Transmitter
 * @{
 */
#define USBDM_CMT_IS_DEFINED
/**
 * Peripheral information for CMT, Carrier Modulator Transmitter.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class CmtInfo {
public:
   // Template:cmt_0

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = CMT_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<CMT_Type> cmt = baseAddress;

   //! Map all allocated pins on a peripheral when enabled
   static constexpr bool mapPinsOnEnable = false;

   /* Template_irqOption.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = CMT_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   /** 
    *  Enable clock to Cmt
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableCmtClock();
#else
      SIM->SCGC4 = SIM->SCGC4 | SIM_SCGC4_CMT_MASK;
#endif
   }

   /** 
    *  Disable clock to Cmt
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableCmtClock();
#else
      SIM->SCGC4 = SIM->SCGC4 & ~SIM_SCGC4_CMT_MASK;
#endif
   }

   //! Number of signals available in info table
   static constexpr int numSignals  = 1;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: CMT_IRO              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {
   }

};

/** 
 * End group CMT_Group
 * @}
 */
/**
 * @addtogroup Control_Group CONTROL, Control
 * @brief Abstraction for Control
 * @{
 */
#define USBDM_CONTROL_IS_DEFINED
/**
 * Peripheral information for CONTROL, Control.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class ControlInfo {
public:
   // Template:control

   //! Number of signals available in info table
   static constexpr int numSignals  = 11;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: RESET_b              = RESET_b(p34)                   */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*   1: JTAG_TCLK            = PTA0(p22)                      */  { PortAInfo,  0,            (PcrValue)0x00700UL  },
         /*   2: SWD_CLK              = PTA0(p22)                      */  { PortAInfo,  0,            (PcrValue)0x00700UL  },
         /*   3: JTAG_TDI             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   4: JTAG_TDO             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   5: TRACE_SWO            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   6: JTAG_TMS             = PTA3(p25)                      */  { PortAInfo,  3,            (PcrValue)0x00700UL  },
         /*   7: SWD_DIO              = PTA3(p25)                      */  { PortAInfo,  3,            (PcrValue)0x00700UL  },
         /*   8: NMI_b                = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   9: JTAG_TRST_b          = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  10: CLKOUT               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {

#if defined(PCC_PCCn_CGC_MASK)
PCC->PCC_PORTA = PCC_PCCn_CGC_MASK;
#else
enablePortClocks(PORTA_CLOCK_MASK);
#endif

PORTA->GPCLR = 0x0700UL|PORT_GPCLR_GPWE(0x0009UL);
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {

#if defined(PCC_PCCn_CGC_MASK)
PCC->PCC_PORTA = PCC_PCCn_CGC_MASK;
#else
enablePortClocks(PORTA_CLOCK_MASK);
#endif

PORTA->GPCLR = PinMux_Disabled|PORT_GPCLR_GPWE(0x0U);
   }

};

/** 
 * End group Control_Group
 * @}
 */
/**
 * @addtogroup CRC_Group CRC, Cyclic Redundancy Check
 * @brief Abstraction for Cyclic Redundancy Check
 * @{
 */
#define USBDM_CRC0_IS_DEFINED
/**
 * Peripheral information for CRC, Cyclic Redundancy Check.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class Crc0Info {
public:
   // Template:crc0_0x40032000

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = CRC0_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<CRC_Type> crc = baseAddress;

   static constexpr uint32_t gpoly =  0;

   /** 
    *  Enable clock to Crc0
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableCrc0Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 | SIM_SCGC6_CRC_MASK;
#endif
   }

   /** 
    *  Disable clock to Crc0
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableCrc0Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 & ~SIM_SCGC6_CRC_MASK;
#endif
   }

