podonoghue/SolderingStation/Software/KinetisBootloader/Project_Headers/pin_mapping.h
   //! Hardware base pointer
   static constexpr HardwarePtr<EWM_Type> ewm = baseAddress;

   //! Map all allocated pins on a peripheral when enabled
   static constexpr bool mapPinsOnEnable = false;

   //! Pin number in Info table for EWM input if mapped to a pin
   static constexpr int inputPin  = 0;

   //! Pin number in Info table for EWM output if mapped to a pin
   static constexpr int outputPin  = 1;

   /* Template_irqOptionSubstituted.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = EWM_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   /** 
    *  Enable clock to Ewm
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableEwmClock();
#else
      SIM->SCGC4 = SIM->SCGC4 | SIM_SCGC4_EWM_MASK;
#endif
   }

   /** 
    *  Disable clock to Ewm
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableEwmClock();
#else
      SIM->SCGC4 = SIM->SCGC4 & ~SIM_SCGC4_EWM_MASK;
#endif
   }

   //! Number of signals available in info table
   static constexpr int numSignals  = 2;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: EWM_IN               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   1: EWM_OUT_b            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {
   }

};

/** 
 * End group EWM_Group
 * @}
 */
/**
 * @addtogroup FTFL_Group FTFL, Flash Memory Module
 * @brief Abstraction for Flash Memory Module
 * @{
 */
#define USBDM_FTFL_IS_DEFINED
/**
 * Peripheral information for FTFL, Flash Memory Module.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class FtflInfo {
public:
   // Template:ftfl

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = FTFL_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<FTFL_Type> ftfl = baseAddress;

   struct EepromSizes {
      const uint16_t size;    // EEPROM size
      const uint8_t  value;   // Value to select size
   };

   /** EEPROM Data Set Size Field */
   static constexpr EepromSizes eepromSizes[] = {
         // Size  Value
         {  32,   0x09, },
         {  64,   0x08, },
         {  128,  0x07, },
         {  256,  0x06, },
         {  512,  0x05, },
         {  1024, 0x04, },
         {  2048, 0x03, },
   };

   struct PartitionInformation {
      const uint32_t flashSize;     //! Remaining data flash
      const uint32_t eeepromSize;   //! Flash allocated to EEPROM backing store
      const uint8_t  value;         //! Partition value
   };

   /** Flash partition information */
   static constexpr PartitionInformation partitionInformation[] {
         // Flash   Backing   Value
         { 32*1024, 0*1024 ,  0xFF},
         { 24*1024, 8*1024 ,  0x01},
         { 16*1024, 16*1024,  0x0A},
         { 8*1024,  24*1024,  0x09},
         { 0*1024,  32*1024,  0x08},
   };

   /** Selects EEPROM size */
   enum EepromSel {
      EepromSel_32Bytes,
      EepromSel_64Bytes,
      EepromSel_128Bytes,
      EepromSel_256Bytes,
      EepromSel_512Bytes,
      EepromSel_1KBytes,
      EepromSel_2KBytes,
   };

   /** Selects division of FlexNVM between flash and EEPROM backing storage */
   enum PartitionSel {
      PartitionSel_flash32K_eeprom0K,
      PartitionSel_flash24K_eeprom8K,
      PartitionSel_flash16K_eeprom16K,
      PartitionSel_flash8K_eeprom24K,
      PartitionSel_flash0K_eeprom32K,
   
      // All EEPROM
      PartitionSel_flash0K_eeprom_all = PartitionSel_flash0K_eeprom32K,
   };

   /**
    * Selects division of the EEPROM
    * Not supported on this device
    */
   enum SplitSel {
      // Not supported
      SplitSel_disabled=0x30,
   };

   //! FlexNVM - EEPROM size
   static constexpr EepromSel eepromSel = EepromSel_2KBytes;

   //! FlexNVM - Flash EEPROM partition
   static constexpr PartitionSel partitionSel = PartitionSel_flash0K_eeprom32K;

   //! FlexNVM - EEPROM partition - not available
   static constexpr SplitSel partitionSplit = SplitSel_disabled;

   /* Template_irqOption.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = FTFL_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   /** 
    *  Enable clock to Ftfl
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableFtflClock();
#else
      SIM->SCGC6 = SIM->SCGC6 | SIM_SCGC6_FTFL_MASK;
#endif
   }

   /** 
    *  Disable clock to Ftfl
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableFtflClock();
#else
      SIM->SCGC6 = SIM->SCGC6 & ~SIM_SCGC6_FTFL_MASK;
#endif
   }

};

/** 
 * End group FTFL_Group
 * @}
 */
/**
 * @addtogroup FTM_Group FTM, PWM, Input capture and Output compare
 * @brief Abstraction for PWM, Input capture and Output compare
 * @{
 */
#define USBDM_FTM_IS_DEFINED
/**
 * Peripheral information for FTM, PWM, Input capture and Output compare.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class FtmInfo {
public:
   // Template:ftm

   //! Number of signals available in info table
   static constexpr int numSignals  = 2;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

