podonoghue/SolderingStation/Software/KinetisBootloader/Project_Headers/pin_mapping.h
   static constexpr uint8_t vref_trm = 
       VREF_TRM_CHOPEN(1); // Chop oscillator enable
       //                  // Trim bits are preserved

   static constexpr uint8_t vref_sc = 
       VREF_SC_VREFEN(1) |   // Internal Voltage Reference enable
       VREF_SC_REGEN(1) |    // Regulator enable
       VREF_SC_ICOMPEN(1) |  // Second order curvature compensation enable
       VREF_SC_MODE_LV(1);   // Buffer Mode selection 

   /** 
    *  Enable clock to Vref
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableVrefClock();
#else
      SIM->SCGC4 = SIM->SCGC4 | SIM_SCGC4_VREF_MASK;
#endif
   }

   /** 
    *  Disable clock to Vref
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableVrefClock();
#else
      SIM->SCGC4 = SIM->SCGC4 & ~SIM_SCGC4_VREF_MASK;
#endif
   }

   //! Number of signals available in info table
   static constexpr int numSignals  = 1;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: VREF_OUT             = VREF_OUT(p17)                  */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {
   }

};

/** 
 * End group VREF_Group
 * @}
 */
/**
 * @addtogroup WDOG_Group WDOG, Watchdog Timer
 * @brief Abstraction for Watchdog Timer
 * @{
 */
#define USBDM_WDOG_IS_DEFINED
/**
 * Peripheral information for WDOG, Watchdog Timer.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class WdogInfo {
public:
   // Template:wdog_mk

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = WDOG_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<WDOG_Type> wdog = baseAddress;

   /* Template_irqOption.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = WDOG_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   /**
    * Get input clock frequency
    *
    * @return Input clock frequency as a uint32_t in Hz
    */
   static uint32_t getInputClockFrequency() {
   
      switch(wdog->STCTRLH&WDOG_STCTRLH_CLKSRC_MASK) {
      default:
      case WDOG_STCTRLH_CLKSRC(0): return PmcInfo::getLpoClock(); // LPO
      case WDOG_STCTRLH_CLKSRC(1): return SystemBusClock;         // Alt = System Bus Clock
      }
   }

};

/** 
 * End group WDOG_Group
 * @}
 */
/** 
 * End group USBDM_Group
 * @}
 */

} // End namespace USBDM


// GPIO definitions are needed generally
#include "gpio.h"

///
/// @page PinSummary Pin Mapping
///
/// @section PinsByPinName Pins by Pin Name
///
///   Pin Name      | C Identifier                  |  Functions                                         |  Location                 |  Description
///  -------------- | ------------------------------|--------------------------------------------------- | ------------------------- | ----------------------------------------------------
///  PTC0           | IcpDebugLed                   | GPIOC_0                                            | p43                       | CH1_SEL
///  PTD3           | IcpButton                     | GPIOD_3                                            | p60                       | SEL_BTN
///  RESET_b        |                               | RESET_b                                            | p34                       | Reset
///  USB0_DM        | -                             | USB0_DM                                            | p6                        | USBDM
///  USB0_DP        | -                             | USB0_DP                                            | p5                        | USBDP
///  VBAT           | -                             | VBAT                                               | p21                       | Vdd
///  VDDA           | -                             | VDDA                                               | p13                       | Vdd
///  VOUT33         | -                             | VOUT33                                             | p7                        | Vdd
///  VREFH          | -                             | VREFH                                              | p14                       | Vdd
///  VREFL          | -                             | VREFL                                              | p15                       | Vss
///  VREF_OUT       | -                             | VREF_OUT                                           | p17                       | Unused
///  VREGIN         | -                             | VREGIN                                             | p8                        | 5V_Fused
///  VSSA           | -                             | VSSA                                               | p16                       | Vss
///  XTAL32         | -                             | XTAL32                                             | p19                       | Unused
///
///
/// @section PinsByLocation Pins by Location
///
///   Pin Name      | C Identifier                  |  Functions                                         |  Location                 |  Description
///  -------------- | ------------------------------|--------------------------------------------------- | ------------------------- | ----------------------------------------------------
///  USB0_DP        | -                             | USB0_DP                                            | p5                        | USBDP
///  USB0_DM        | -                             | USB0_DM                                            | p6                        | USBDM
///  VOUT33         | -                             | VOUT33                                             | p7                        | Vdd
///  VREGIN         | -                             | VREGIN                                             | p8                        | 5V_Fused
///  VDDA           | -                             | VDDA                                               | p13                       | Vdd
///  VREFH          | -                             | VREFH                                              | p14                       | Vdd
///  VREFL          | -                             | VREFL                                              | p15                       | Vss
///  VSSA           | -                             | VSSA                                               | p16                       | Vss
///  VREF_OUT       | -                             | VREF_OUT                                           | p17                       | Unused
///  XTAL32         | -                             | XTAL32                                             | p19                       | Unused
///  VBAT           | -                             | VBAT                                               | p21                       | Vdd
///  RESET_b        |                               | RESET_b                                            | p34                       | Reset
///  PTC0           | IcpDebugLed                   | GPIOC_0                                            | p43                       | CH1_SEL
///  PTD3           | IcpButton                     | GPIOD_3                                            | p60                       | SEL_BTN
///
///
/// @section PinsByFunction Pins by Peripheral
///
///   Pin Name      | C Identifier                  |  Functions                                         |  Location                 |  Description
///  -------------- | ------------------------------|--------------------------------------------------- | ------------------------- | ----------------------------------------------------
///  PTC0           | IcpDebugLed                   | GPIOC_0                                            | p43                       | CH1_SEL
///  PTD3           | IcpButton                     | GPIOD_3                                            | p60                       | SEL_BTN
///  RESET_b        |                               | RESET_b                                            | p34                       | Reset
///  USB0_DM        | -                             | USB0_DM                                            | p6                        | USBDM
///  USB0_DP        | -                             | USB0_DP                                            | p5                        | USBDP
///  VBAT           | -                             | VBAT                                               | p21                       | Vdd
///  VDDA           | -                             | VDDA                                               | p13                       | Vdd
///  VOUT33         | -                             | VOUT33                                             | p7                        | Vdd
///  VREFH          | -                             | VREFH                                              | p14                       | Vdd
///  VREFL          | -                             | VREFL                                              | p15                       | Vss
///  VREF_OUT       | -                             | VREF_OUT                                           | p17                       | Unused
///  VREGIN         | -                             | VREGIN                                             | p8                        | 5V_Fused
///  VSSA           | -                             | VSSA                                               | p16                       | Vss
///  XTAL32         | -                             | XTAL32                                             | p19                       | Unused
///
///

#endif /* PROJECT_HEADERS_PIN_MAPPING_H */
